{
  "<pad>": 0,
  "<bos>": 1,
  "<eos>": 2,
  "<unk>": 3,
  "{": 4,
  "}": 5,
  "(": 6,
  ")": 7,
  "[": 8,
  "]": 9,
  "^": 10,
  "_": 11,
  "&": 12,
  "|": 13,
  "+": 14,
  "-": 15,
  "*": 16,
  "/": 17,
  "=": 18,
  "<": 19,
  ">": 20,
  ",": 21,
  ".": 22,
  ":": 23,
  ";": 24,
  "!": 25,
  "\\frac": 26,
  "\\dfrac": 27,
  "\\tfrac": 28,
  "\\sqrt": 29,
  "\\sum": 30,
  "\\prod": 31,
  "\\int": 32,
  "\\iint": 33,
  "\\iiint": 34,
  "\\oint": 35,
  "\\lim": 36,
  "\\sup": 37,
  "\\inf": 38,
  "\\max": 39,
  "\\min": 40,
  "\\sin": 41,
  "\\cos": 42,
  "\\tan": 43,
  "\\cot": 44,
  "\\sec": 45,
  "\\csc": 46,
  "\\arcsin": 47,
  "\\arccos": 48,
  "\\arctan": 49,
  "\\sinh": 50,
  "\\cosh": 51,
  "\\tanh": 52,
  "\\log": 53,
  "\\ln": 54,
  "\\exp": 55,
  "\\partial": 56,
  "\\nabla": 57,
  "\\infty": 58,
  "\\to": 59,
  "\\rightarrow": 60,
  "\\leftarrow": 61,
  "\\Rightarrow": 62,
  "\\Leftarrow": 63,
  "\\longrightarrow": 64,
  "\\longleftarrow": 65,
  "\\leftrightarrow": 66,
  "\\Leftrightarrow": 67,
  "\\mapsto": 68,
  "\\forall": 69,
  "\\exists": 70,
  "\\nexists": 71,
  "\\in": 72,
  "\\notin": 73,
  "\\subset": 74,
  "\\supset": 75,
  "\\subseteq": 76,
  "\\supseteq": 77,
  "\\cup": 78,
  "\\cap": 79,
  "\\setminus": 80,
  "\\emptyset": 81,
  "\\wedge": 82,
  "\\vee": 83,
  "\\neg": 84,
  "\\cdot": 85,
  "\\times": 86,
  "\\div": 87,
  "\\pm": 88,
  "\\mp": 89,
  "\\leq": 90,
  "\\geq": 91,
  "\\neq": 92,
  "\\approx": 93,
  "\\equiv": 94,
  "\\sim": 95,
  "\\simeq": 96,
  "\\cong": 97,
  "\\propto": 98,
  "\\perp": 99,
  "\\parallel": 100,
  "\\left": 101,
  "\\right": 102,
  "\\big": 103,
  "\\Big": 104,
  "\\bigg": 105,
  "\\Bigg": 106,
  "\\overline": 107,
  "\\underline": 108,
  "\\hat": 109,
  "\\bar": 110,
  "\\tilde": 111,
  "\\vec": 112,
  "\\dot": 113,
  "\\ddot": 114,
  "\\overbrace": 115,
  "\\underbrace": 116,
  "\\binom": 117,
  "\\choose": 118,
  "\\text": 119,
  "\\mathrm": 120,
  "\\mathbf": 121,
  "\\mathit": 122,
  "\\mathcal": 123,
  "\\mathbb": 124,
  "\\mathfrak": 125,
  "\\boldsymbol": 126,
  "\\alpha": 127,
  "\\beta": 128,
  "\\gamma": 129,
  "\\delta": 130,
  "\\epsilon": 131,
  "\\varepsilon": 132,
  "\\zeta": 133,
  "\\eta": 134,
  "\\theta": 135,
  "\\vartheta": 136,
  "\\iota": 137,
  "\\kappa": 138,
  "\\lambda": 139,
  "\\mu": 140,
  "\\nu": 141,
  "\\xi": 142,
  "\\pi": 143,
  "\\varpi": 144,
  "\\rho": 145,
  "\\varrho": 146,
  "\\sigma": 147,
  "\\varsigma": 148,
  "\\tau": 149,
  "\\upsilon": 150,
  "\\phi": 151,
  "\\varphi": 152,
  "\\chi": 153,
  "\\psi": 154,
  "\\omega": 155,
  "\\Gamma": 156,
  "\\Delta": 157,
  "\\Theta": 158,
  "\\Lambda": 159,
  "\\Xi": 160,
  "\\Pi": 161,
  "\\Sigma": 162,
  "\\Upsilon": 163,
  "\\Phi": 164,
  "\\Psi": 165,
  "\\Omega": 166,
  "\\begin": 167,
  "\\end": 168,
  "aligned": 169,
  "cases": 170,
  "pmatrix": 171,
  "bmatrix": 172,
  "vmatrix": 173,
  "Bmatrix": 174,
  "Vmatrix": 175,
  "matrix": 176,
  "array": 177,
  "equation": 178,
  "gather": 179,
  "\\\\": 180,
  "\\,": 181,
  "\\;": 182,
  "\\:": 183,
  "\\!": 184,
  "\\quad": 185,
  "\\qquad": 186,
  "\\rightleftharpoons": 187,
  "\\xrightarrow": 188,
  "\\ce": 189,
  "\\hbar": 190,
  "\\ell": 191,
  "\\prime": 192,
  "'": 193,
  "\\ldots": 194,
  "\\cdots": 195,
  "\\vdots": 196,
  "\\ddots": 197,
  "\\dagger": 198,
  "\\ddagger": 199,
  "\\circ": 200,
  "\\bullet": 201,
  "\\star": 202,
  "a": 203,
  "b": 204,
  "c": 205,
  "d": 206,
  "e": 207,
  "f": 208,
  "g": 209,
  "h": 210,
  "i": 211,
  "j": 212,
  "k": 213,
  "l": 214,
  "m": 215,
  "n": 216,
  "o": 217,
  "p": 218,
  "q": 219,
  "r": 220,
  "s": 221,
  "t": 222,
  "u": 223,
  "v": 224,
  "w": 225,
  "x": 226,
  "y": 227,
  "z": 228,
  "A": 229,
  "B": 230,
  "C": 231,
  "D": 232,
  "E": 233,
  "F": 234,
  "G": 235,
  "H": 236,
  "I": 237,
  "J": 238,
  "K": 239,
  "L": 240,
  "M": 241,
  "N": 242,
  "O": 243,
  "P": 244,
  "Q": 245,
  "R": 246,
  "S": 247,
  "T": 248,
  "U": 249,
  "V": 250,
  "W": 251,
  "X": 252,
  "Y": 253,
  "Z": 254,
  "0": 255,
  "1": 256,
  "2": 257,
  "3": 258,
  "4": 259,
  "5": 260,
  "6": 261,
  "7": 262,
  "8": 263,
  "9": 264,
  " ": 265,
  "12": 266,
  "11": 267,
  "10": 268,
  "71": 269,
  "88": 270,
  "81": 271,
  "86": 272,
  "79": 273,
  "47": 274,
  "58": 275,
  "48": 276,
  "31": 277,
  "29": 278,
  "50": 279,
  "40": 280,
  "42": 281,
  "73": 282,
  "17": 283,
  "22": 284,
  "91": 285,
  "66": 286,
  "60": 287,
  "19": 288,
  "38": 289,
  "39": 290,
  "34": 291,
  "82": 292,
  "59": 293,
  "20": 294,
  "93": 295,
  "98": 296,
  "33": 297,
  "68": 298,
  "21": 299,
  "13": 300,
  "32": 301,
  "27": 302,
  "45": 303,
  "89": 304,
  "76": 305,
  "64": 306,
  "95": 307,
  "94": 308,
  "18": 309,
  "41": 310,
  "67": 311,
  "49": 312,
  "15": 313,
  "26": 314,
  "14": 315,
  "46": 316,
  "78": 317,
  "70": 318,
  "92": 319,
  "55": 320,
  "52": 321,
  "84": 322,
  "44": 323,
  "69": 324,
  "62": 325,
  "72": 326,
  "87": 327,
  "25": 328,
  "28": 329,
  "65": 330,
  "16": 331,
  "30": 332,
  "74": 333,
  "61": 334,
  "63": 335,
  "99": 336,
  "54": 337,
  "43": 338,
  "37": 339,
  "85": 340,
  "96": 341,
  "57": 342,
  "80": 343,
  "24": 344,
  "90": 345,
  "56": 346,
  "75": 347,
  "35": 348,
  "23": 349,
  "97": 350,
  "36": 351,
  "53": 352,
  "83": 353,
  "51": 354,
  "77": 355
}